{
  "@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime":"2025-12-01T13:37:36.4387981Z",
  "creationSource":null,
  "description":"Setup the baseline settings to manage macOS updates.",
  "lastModifiedDateTime":"2025-12-04T07:15:10.6429455Z",
  "name":"MacOS - OIB - Updates - D - DDM Updates Configuration v1.0",
  "platforms":"macOS",
  "priorityMetaData":null,
  "roleScopeTagIds":[
    "0"
  ],
  "settingCount":1,
  "technologies":"mdm,appleRemoteManagement",
  "id":"0ffdc0b3-4ed6-477f-958a-3d128d251131",
  "templateReference":{
    "templateId":"",
    "templateFamily":"none",
    "templateDisplayName":null,
    "templateDisplayVersion":null
  },
  "settings":[
    {
      "id":"0",
      "settingInstance":{
        "@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId":"softwareupdate_softwareupdate",
        "settingInstanceTemplateReference":null,
        "auditRuleInformation":null,
        "groupSettingCollectionValue":[
          {
            "settingValueTemplateReference":null,
            "children":[
              {
                "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":"softwareupdate_allowstandarduserosupdates",
                "settingInstanceTemplateReference":null,
                "auditRuleInformation":null,
                "choiceSettingValue":{
                  "settingValueTemplateReference":null,
                  "value":"softwareupdate_allowstandarduserosupdates_true",
                  "children":[
                    
                  ]
                }
              },
              {
                "@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId":"softwareupdate_automaticactions",
                "settingInstanceTemplateReference":null,
                "auditRuleInformation":null,
                "groupSettingCollectionValue":[
                  {
                    "settingValueTemplateReference":null,
                    "children":[
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId":"softwareupdate_automaticactions_download",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "choiceSettingValue":{
                          "settingValueTemplateReference":null,
                          "value":"softwareupdate_automaticactions_download_1",
                          "children":[
                            
                          ]
                        }
                      },
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId":"softwareupdate_automaticactions_installosupdates",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "choiceSettingValue":{
                          "settingValueTemplateReference":null,
                          "value":"softwareupdate_automaticactions_installosupdates_1",
                          "children":[
                            
                          ]
                        }
                      },
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId":"softwareupdate_automaticactions_installsecurityupdate",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "choiceSettingValue":{
                          "settingValueTemplateReference":null,
                          "value":"softwareupdate_automaticactions_installsecurityupdate_1",
                          "children":[
                            
                          ]
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId":"softwareupdate_deferrals",
                "settingInstanceTemplateReference":null,
                "auditRuleInformation":null,
                "groupSettingCollectionValue":[
                  {
                    "settingValueTemplateReference":null,
                    "children":[
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId":"softwareupdate_deferrals_majorperiodindays",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "simpleSettingValue":{
                          "@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference":null,
                          "value":30
                        }
                      },
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId":"softwareupdate_deferrals_minorperiodindays",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "simpleSettingValue":{
                          "@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference":null,
                          "value":15
                        }
                      },
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "settingDefinitionId":"softwareupdate_deferrals_systemperiodindays",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "simpleSettingValue":{
                          "@odata.type":"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                          "settingValueTemplateReference":null,
                          "value":15
                        }
                      }
                    ]
                  }
                ]
              },
              {
                "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":"softwareupdate_notifications",
                "settingInstanceTemplateReference":null,
                "auditRuleInformation":null,
                "choiceSettingValue":{
                  "settingValueTemplateReference":null,
                  "value":"softwareupdate_notifications_true",
                  "children":[
                    
                  ]
                }
              },
              {
                "@odata.type":"#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId":"softwareupdate_rapidsecurityresponse",
                "settingInstanceTemplateReference":null,
                "auditRuleInformation":null,
                "groupSettingCollectionValue":[
                  {
                    "settingValueTemplateReference":null,
                    "children":[
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId":"softwareupdate_rapidsecurityresponse_enable",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "choiceSettingValue":{
                          "settingValueTemplateReference":null,
                          "value":"softwareupdate_rapidsecurityresponse_enable_true",
                          "children":[
                            
                          ]
                        }
                      },
                      {
                        "@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                        "settingDefinitionId":"softwareupdate_rapidsecurityresponse_enablerollback",
                        "settingInstanceTemplateReference":null,
                        "auditRuleInformation":null,
                        "choiceSettingValue":{
                          "settingValueTemplateReference":null,
                          "value":"softwareupdate_rapidsecurityresponse_enablerollback_true",
                          "children":[
                            
                          ]
                        }
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    }
  ]
}